---
type: MEPModel
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# MEPModel

`Autodesk.Revit.DB.MEPModel` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetAssignedElectricalSystems | 2021 | `public ISet < ElectricalSystem > GetAssignedElectricalSystems ()` |
| Method | GetElectricalSystems | 2021 | `public ISet < ElectricalSystem > GetElectricalSystems ()` |
| Property | ConnectorManager | — | `public ConnectorManager ConnectorManager { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |